app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "image_url", "datetime", "content") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "posts" SET "content" = $1 WHERE "posts"."id" = $2